In [ ]:
import seaborn as sns
sns_df = sns.load_dataset('iris')
sns_df.to_csv('iris.csv', index=False)

In [2]:
import os
import numpy as np
import pandas as pd

## Pandas main usage
   - Data exploration
   - Data cleaning

## Basic exploration with Pandas

In [84]:
# Read data in csv format
iris_df = pd.read_csv('sampledata/iris.csv')

The created dataframe have methods and attributes to help you manipulate the data

In [85]:
# Return column names
iris_df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [86]:
# Show the dimensions of te dataframe (length x width)
iris_df.shape

(150, 5)

In [87]:
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [88]:
iris_df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [18]:
#Show major descriptive statistics of numeric columns
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Example 1 clean sp matrix for diversity calculation

In [105]:
df = pd.read_csv('sampledata/sp_matrix_raw.csv')

In [106]:
df.head()

,Eva,Trans,Cuadra,Esp_1_A,Esp_2_A,Esp_3_A,Esp_4_A,Esp_5_A,Esp_6_A,Esp_7_A,...,Esp_20_A,Esp_21_A,Esp_22_A,Esp_23_A,Esp_24_A,Esp_25_A,Esp_26_A,Esp_27_A,Esp_28_A,Esp_29_A
0,1C,L,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1C,L,2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1C,L,3,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1C,L,4,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1C,L,5,0,0,0,3,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [107]:
df.columns

Index(['Eva', 'Trans', 'Cuadra', 'Esp_1_A', 'Esp_2_A', 'Esp_3_A', 'Esp_4_A',
       'Esp_5_A', 'Esp_6_A', 'Esp_7_A', 'Esp_8_A', 'Esp_9_A', 'Esp_10_A',
       'Esp_11_A', 'Esp_12_A', 'Esp_13_A', 'Esp_14_A', 'Esp_15_A', 'Esp_16_A',
       'Esp_17_A', 'Esp_18_A', 'Esp_19_A', 'Esp_20_A', 'Esp_21_A', 'Esp_22_A',
       'Esp_23_A', 'Esp_24_A', 'Esp_25_A', 'Esp_26_A', 'Esp_27_A', 'Esp_28_A',
       'Esp_29_A'],
      dtype='object')

In [108]:
df.shape

(120, 32)

In [109]:
df.index

RangeIndex(start=0, stop=120, step=1)

### Data transformation steps

In [110]:
df.index

RangeIndex(start=0, stop=120, step=1)

In [111]:
# Create a new column and assign index values to it
df['id'] = df.index

In [112]:
# Reformat dataframe to long format
df_long = pd.wide_to_long(df,
                          stubnames='Esp',
                          i='id',
                          j='Species',
                          sep='_',
                          suffix="\\w+")

In [113]:
df_long = df_long.reset_index()

In [114]:
df_long.shape

(3480, 6)

In [115]:
df.shape

(120, 33)

In [116]:
# Create mask True when species abundance is not 0
mask = df_long['Esp'] != 0

In [117]:
# Group all unique values in the series and count them
mask.value_counts()

False    3249
True      231
Name: Esp, dtype: int64

In [118]:
# Check how many rows were taken out
df_long[mask].shape

(231, 6)

In [119]:
# Rewrites object with filtered values
df_long = df_long[mask]

In [120]:
#df_long.to_csv('sp_long_format.csv', index=False, sep=',')

In [121]:
df_long

       id Species  Cuadra Trans Eva  Esp
26     26     1_A       2     P  2C    1
40     40     1_A       1     L  3C    1
155    35     2_A       1     P  2S   18
156    36     2_A       2     P  2S    5
158    38     2_A       4     P  2S    3
...   ...     ...     ...   ...  ..  ...
3355  115    28_A       1     P  6S    4
3356  116    28_A       2     P  6S    5
3410   50    29_A       1     L  3S    1
3430   70    29_A       1     L  4S    1
3443   83    29_A       4     L  5C    1

[231 rows x 6 columns]

In [122]:
sepa = df_long.Eva.str.extract('(?P<trip>\d+)(?P<beach>\w+)',expand=True)

In [123]:
sepa

     trip beach
26      2     C
40      3     C
155     2     S
156     2     S
158     2     S
...   ...   ...
3355    6     S
3356    6     S
3410    3     S
3430    4     S
3443    5     C

[231 rows x 2 columns]

In [126]:
to_concat = [df_long, sepa]
concat_df = pd.concat(to_concat, axis=1)

In [128]:
concat_df.head()

     id Species  Cuadra Trans Eva  Esp trip beach
26   26     1_A       2     P  2C    1    2     C
40   40     1_A       1     L  3C    1    3     C
155  35     2_A       1     P  2S   18    2     S
156  36     2_A       2     P  2S    5    2     S
158  38     2_A       4     P  2S    3    2     S

### Group by Beach

In [131]:
group_cols = ['Species', 'beach']
sp_by_beach = concat_df.groupby(group_cols)['Esp'].sum()

In [147]:
sp_by_beach.sort_values(ascending=False)

Species  beach
21_A     S        990
11_A     S        206
14_A     S        174
17_A     S        173
28_A     S        160
17_A     C         99
13_A     S         93
11_A     C         80
14_A     C         59
19_A     C         57
23_A     S         55
24_A     C         49
22_A     S         49
4_A      S         48
20_A     C         38
2_A      S         28
8_A      S         27
10_A     S         26
12_A     S         21
4_A      C         13
8_A      C         11
18_A     C         11
15_A     C         11
20_A     S         10
16_A     C         10
13_A     C          9
27_A     S          4
9_A      S          2
1_A      C          2
29_A     S          2
6_A      C          1
7_A      C          1
25_A     S          1
5_A      C          1
26_A     S          1
29_A     C          1
19_A     S          1
28_A     C          1
3_A      S          1
Name: Esp, dtype: int64

In [153]:
concat_df

       id Species  Cuadra Trans Eva  Esp trip beach
26     26     1_A       2     P  2C    1    2     C
40     40     1_A       1     L  3C    1    3     C
155    35     2_A       1     P  2S   18    2     S
156    36     2_A       2     P  2S    5    2     S
158    38     2_A       4     P  2S    3    2     S
...   ...     ...     ...   ...  ..  ...  ...   ...
3355  115    28_A       1     P  6S    4    6     S
3356  116    28_A       2     P  6S    5    6     S
3410   50    29_A       1     L  3S    1    3     S
3430   70    29_A       1     L  4S    1    4     S
3443   83    29_A       4     L  5C    1    5     C

[231 rows x 8 columns]

## Exchange with meaninful names

In [157]:
sp_df = pd.read_csv('sampledata/sp_list.csv')

In [161]:
sp_df.sp_id.dtype

dtype('int64')

In [167]:
concat_df['sp_fk'] = [int(i[0]) for i in concat_df.Species.str.split('_')]

In [169]:
# Clean species names
clean_df = pd.merge(
    concat_df, # left dataframe
    sp_df, # right dataframe
    how= 'left', # join type
    left_on='sp_fk', #left key
    right_on='sp_id' # right key
)

In [170]:
# Clean beach name
beach_legend = {'C':'Corbanitos','S':'Salinas'}
clean_df.replace(beach_legend, inplace=True)

In [176]:
clean_df.head()

,id,Species,Cuadra,Trans,Eva,Esp,trip,beach,sp_fk,sp_id,sp_name,season
0,26,1_A,2,P,2C,1,2,Corbanitos,1,1,Acanthophora spicifera,Spring
1,40,1_A,1,L,3C,1,3,Corbanitos,1,1,Acanthophora spicifera,Summer
2,35,2_A,1,P,2S,18,2,Salinas,2,2,Acetabularia schenckii,Spring
3,36,2_A,2,P,2S,5,2,Salinas,2,2,Acetabularia schenckii,Spring
4,38,2_A,4,P,2S,3,2,Salinas,2,2,Acetabularia schenckii,Spring

### Assing season to trips

In [173]:
def create_estacion(x):
    if x in ['1','2']:
        return 'Spring'
    elif x in ['3','4']:
        return 'Summer'
    elif x in ['5','6']:
        return 'Winter'
    else:
        return x

In [175]:
clean_df['season'] = clean_df.apply(lambda row: create_estacion(row['trip']),axis=1)

In [178]:
clean_df.season.value_counts()

Spring    115
Summer     77
Winter     39
Name: season, dtype: int64

In [180]:
clean_df['site'] = clean_df[['beach','season']].apply("-".join, axis=1)

In [183]:
clean_df.rename(columns={'Esp':'abundance'}, inplace=True)

In [184]:
clean_df.columns

Index(['id', 'Species', 'Cuadra', 'Trans', 'Eva', 'abundance', 'trip', 'beach',
       'sp_fk', 'sp_id', 'sp_name', 'season', 'site'],
      dtype='object')

In [185]:
select_cols = ['site', 'beach', 'season', 'sp_name', 'abundance']
clean_df = clean_df[select_cols]

In [186]:
clean_df

                  site       beach  season                  sp_name  abundance
0    Corbanitos-Spring  Corbanitos  Spring   Acanthophora spicifera          1
1    Corbanitos-Summer  Corbanitos  Summer   Acanthophora spicifera          1
2       Salinas-Spring     Salinas  Spring  Acetabularia schenckii          18
3       Salinas-Spring     Salinas  Spring  Acetabularia schenckii           5
4       Salinas-Spring     Salinas  Spring  Acetabularia schenckii           3
..                 ...         ...     ...                      ...        ...
226     Salinas-Winter     Salinas  Winter      Udotea cyathiformis          4
227     Salinas-Winter     Salinas  Winter      Udotea cyathiformis          5
228     Salinas-Summer     Salinas  Summer   Ventricaria ventricosa          1
229     Salinas-Summer     Salinas  Summer   Ventricaria ventricosa          1
230  Corbanitos-Winter  Corbanitos  Winter   Ventricaria ventricosa          1

[231 rows x 5 columns]

## Agrugar por playa y estacion del año

In [191]:
# Species richness per site (Beach, Season)
clean_df.groupby(['site']).agg({'sp_name':'nunique','abundance':'sum'})

                   sp_name  abundance
site
Corbanitos-Spring       14        227
Corbanitos-Summer       10        178
Corbanitos-Winter        8         49
Salinas-Spring          15       1113
Salinas-Summer          13        736
Salinas-Winter           5        223

### Transform to species matrix

In [200]:
diver_df = clean_df.groupby(['site', 'sp_name']).agg({'abundance':'sum'}).reset_index()

In [201]:
sp_matrix = diver_df.pivot(index='site',columns='sp_name', values='abundance').fillna(0)

## Calculate Alpha diversity in R

In [217]:
import rpy2.ipython.html
rpy2.ipython.html.init_printing()
%load_ext rpy2.ipython

The rpy2.ipython extension is already loaded. To reload it, use:
  %reload_ext rpy2.ipython

In [231]:
%%R -i sp_matrix -o diver_res

require(vegan)

diver_res = diversity(sp_matrix, index='shannon')
print(diver_res)

Corbanitos-Spring Corbanitos-Summer Corbanitos-Winter    Salinas-Spring
         2.068483          1.344168          1.592021          1.503121
   Salinas-Summer    Salinas-Winter
         1.666383          1.291071

In [230]:
diver_res

R object with classes: ('numeric',) mapped to:
<FloatVector - Python:0x7f0e61b9e448 / R:0x5629fcc28518>
[2.068483, 1.344168, 1.592021, 1.503121, 1.666383, 1.291071]